# Summarize Data

### 기본 통계 하기 value_counts, nunique, sum, count, mean, median

In [1]:
import pandas as pd
import seaborn as sns

In [2]:
df = sns.load_dataset('iris')
df.shape

(150, 5)

In [3]:
df.head(2)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

In [6]:
# 이산 데이터 개수 세는데 주로 사용
df['species'].value_counts()

versicolor    50
virginica     50
setosa        50
Name: species, dtype: int64

In [8]:
# 위 내용을 데이터프레임으로
pd.DataFrame(df['species'].value_counts())

            species
versicolor       50
virginica        50
setosa           50

In [13]:
len(df) == df.shape[0]

True

In [16]:
# distinct한 값 갯수 세어줌
df['petal_length'].nunique()

43

In [17]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [18]:
df.describe(include='all')

        sepal_length  sepal_width  petal_length  petal_width     species
count     150.000000   150.000000    150.000000   150.000000         150
unique           NaN          NaN           NaN          NaN           3
top              NaN          NaN           NaN          NaN  versicolor
freq             NaN          NaN           NaN          NaN          50
mean        5.843333     3.057333      3.758000     1.199333         NaN
std         0.828066     0.435866      1.765298     0.762238         NaN
min         4.300000     2.000000      1.000000     0.100000         NaN
25%         5.100000     2.800000      1.600000     0.300000         NaN
50%         5.800000     3.000000      4.350000     1.300000         NaN
75%         6.400000     3.300000      5.100000     1.800000         NaN
max         7.900000     4.400000      6.900000     2.500000         NaN

In [19]:
import numpy as np

In [20]:
df.describe(include=[np.object])

           species
count          150
unique           3
top     versicolor
freq            50

In [21]:
df.describe(include=[np.number])

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

```
sum()
count()
median()
min()
max()
mean()
var()
std()
```

In [25]:
df['petal_width'].sum()

179.90000000000003

In [26]:
df['petal_width'].count()

150

In [27]:
df['petal_width'].median()

1.3

In [32]:
df.mean()

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [28]:
df['petal_width'].mean()

1.199333333333334

In [33]:
df['petal_width'].quantile([0.25,0.75])

0.25    0.3
0.75    1.8
Name: petal_width, dtype: float64

In [34]:
df.quantile([0.25,0.75])

      sepal_length  sepal_width  petal_length  petal_width
0.25           5.1          2.8           1.6          0.3
0.75           6.4          3.3           5.1          1.8

In [35]:
df.min()

sepal_length       4.3
sepal_width          2
petal_length         1
petal_width        0.1
species         setosa
dtype: object

In [36]:
df.max()

sepal_length          7.9
sepal_width           4.4
petal_length          6.9
petal_width           2.5
species         virginica
dtype: object

In [37]:
df.var()

sepal_length    0.685694
sepal_width     0.189979
petal_length    3.116278
petal_width     0.581006
dtype: float64

In [38]:
df.std()

sepal_length    0.828066
sepal_width     0.435866
petal_length    1.765298
petal_width     0.762238
dtype: float64

### 판다스로 apply 활용하기 lambda 익명함수 사용하기

In [39]:
df.apply(lambda x : x[0])

sepal_length       5.1
sepal_width        3.5
petal_length       1.4
petal_width        0.2
species         setosa
dtype: object

#### 우선 lambda 함수가 뭔지 알아보기로 한다.

In [40]:
def add_ten(x):
    return x+10

In [41]:
x=1
add_ten(x)

11

In [42]:
add_ten(4)

14

In [43]:
add_nine = lambda x: x+9

In [45]:
import datetime

In [57]:
def am_i_late(h):
    if h < datetime.time(10, 0, 0):
        return 'on time'
    else:
        return 'you\'re late'

In [58]:
h = datetime.time(9, 30, 40)
am_i_late(h)

'on time'

In [61]:
am_i_late_again = lambda h: 'on time' if h < datetime.time(10, 0, 0) else 'you\'re late'

In [62]:
am_i_late_again(datetime.time(10, 3, 0))

"you're late"

#### 다 알아봤으니 다시 강의를 듣자

In [64]:
 df['species'].apply(lambda x : x[:3])

0      set
1      set
2      set
3      set
4      set
      ...
145    vir
146    vir
147    vir
148    vir
149    vir
Name: species, Length: 150, dtype: object

In [65]:
df['species_3'] = df['species'].apply(lambda x : x[:3])
df

     sepal_length  sepal_width  petal_length  petal_width    species species_3
0             5.1          3.5           1.4          0.2     setosa       set
1             4.9          3.0           1.4          0.2     setosa       set
2             4.7          3.2           1.3          0.2     setosa       set
3             4.6          3.1           1.5          0.2     setosa       set
4             5.0          3.6           1.4          0.2     setosa       set
..            ...          ...           ...          ...        ...       ...
145           6.7          3.0           5.2          2.3  virginica       vir
146           6.3          2.5           5.0          1.9  virginica       vir
147           6.5          3.0           5.2          2.0  virginica       vir
148           6.2          3.4           5.4          2.3  virginica       vir
149           5.9          3.0           5.1          1.8  virginica       vir

[150 rows x 6 columns]

In [66]:
def smp(x):
    # 뒤에서 3번째까지의 문자를 가져오는 함수
    x = x[-3:]
    return x

In [68]:
# 함수를 호출해서 부르기도 가능
df['species-3'] = df['species'].apply(smp)
df

,sepal_length,sepal_width,petal_length,petal_width,species,species_3,species-3
0,5.1,3.5,1.4,0.2,setosa,set,osa
1,4.9,3.0,1.4,0.2,setosa,set,osa
2,4.7,3.2,1.3,0.2,setosa,set,osa
3,4.6,3.1,1.5,0.2,setosa,set,osa
4,5.0,3.6,1.4,0.2,setosa,set,osa
...,...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,vir,ica
146,6.3,2.5,5.0,1.9,virginica,vir,ica
147,6.5,3.0,5.2,2.0,virginica,vir,ica
148,6.2,3.4,5.4,2.3,virginica,vir,ica
149,5.9,3.0,5.1,1.8,virginica,vir,ica

----

# Handling Missing Data

In [73]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [74]:
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [75]:
df.dropna(axis=1, how='all')
# all 모두 널값이면 드롭한다

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [79]:
df.dropna(axis=1, how='any')
# 컬럼에서 any 하나라도 널값이면 드롭한다

       name
0    Alfred
1    Batman
2  Catwoman

In [78]:
df.dropna(axis=0, how='any')
# 열에서 any 하나라도 널값이면 드롭한다

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [82]:
# 널값을 0으로 채워주세요
df.fillna(0)

       name        toy                 born
0    Alfred          0                    0
1    Batman  Batmobile  1940-04-25 00:00:00
2  Catwoman   Bullwhip                    0

In [83]:
# 각 컬럼에 따라 이렇게 다른 값으로 채워주세요!
values = {'name' : 0, 'toy' : 1, 'born' : 2}
df.fillna(value=values)

       name        toy                 born
0    Alfred          1                    2
1    Batman  Batmobile  1940-04-25 00:00:00
2  Catwoman   Bullwhip                    2

In [84]:
df2 = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, 5],
                   [np.nan, 3, np.nan, 4]],
                  columns=list('ABCD'))

In [85]:
df2

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

In [86]:
df2.fillna(0)

     A    B    C  D
0  0.0  2.0  0.0  0
1  3.0  4.0  0.0  1
2  0.0  0.0  0.0  5
3  0.0  3.0  0.0  4

In [89]:
df2['D'].mean()

2.5

In [90]:
fill_na_value = df2['D'].mean()

In [92]:
df2.fillna(fill_na_value)

     A    B    C  D
0  2.5  2.0  2.5  0
1  3.0  4.0  2.5  1
2  2.5  2.5  2.5  5
3  2.5  3.0  2.5  4

In [95]:
# 컬럼별 결측치 갯수 세기
df2.isnull().sum()

A    3
B    1
C    4
D    0
dtype: int64

In [96]:
df2.notnull().sum()

A    1
B    3
C    0
D    4
dtype: int64